In [1]:
import numpy as np
import pandas as pd

In [17]:
# Pandas has two types of data structures:
# a). Series- It's a one dimensional array with indexes,it stores a single column or row of data in a dataframe
# b). DataFrame- It's a tabular spreadsheet like structure representing rows each of which contains one or multi column's

In [2]:
dict1={
    "name":['Ravi','Ram','Ratan','Vivek','Vibha'],
    "marks":[91,86,88,90,89],
    "city":['Delhi','Noida','Hyderabad','Pune','Gurugram']
    
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

    name  marks       city
0   Ravi     91      Delhi
1    Ram     86      Noida
2  Ratan     88  Hyderabad
3  Vivek     90       Pune
4  Vibha     89   Gurugram

In [10]:
# To put the data in to the excel sheet simple use to_csv function it will convert in to csv file
df.to_csv('friends_csv')

In [11]:
df

    name  marks       city
0   Ravi     91      Delhi
1    Ram     86      Noida
2  Ratan     88  Hyderabad
3  Vivek     90       Pune
4  Vibha     89   Gurugram

In [12]:
# if i don't want to see the index of the csv file as in the excel sheet index is already given
df.to_csv("friend_with_index_csv",index=False)

In [13]:
# if we have a huge data and want to see some of the rows from strting 
df.head(2)

   name  marks   city
0  Ravi     91  Delhi
1   Ram     86  Noida

In [14]:
# if we have to less from the last 
df.tail(2)

    name  marks      city
3  Vivek     90      Pune
4  Vibha     89  Gurugram

In [16]:
# want to know some detail of the data frame
df.describe()

           marks
count   5.000000
mean   88.800000
std     1.923538
min    86.000000
25%    88.000000
50%    89.000000
75%    90.000000
max    91.000000

In [6]:
l=[2000,500,200,100,50,20,10,5,1]
x=int(input("ENter the number: "))
d={}
for i in l:
    if x>=i:
        d[i]=x//i
        x=x%i
print(d)

ENter the number: 3856
{2000: 1, 500: 3, 200: 1, 100: 1, 50: 1, 5: 1, 1: 1}

In [9]:
i=0
while i<=6:
    i=i+1
    if i==3:
        continue;
    print(i)

1
2
4
5
6
7

In [27]:
# while loop infinite bhagta hai 
# hume bss while loop mai condition lgani hoti hh usko rokne ke liye
x=10
while x<=20:     
    print(x)#x=1 x=1+1=2
    x=x+1

10
11
12
13
14
15
16
17
18
19
20

In [30]:
# x=x+1 increament  #x=x-1
x=1234
while x:
    b=x%10   #b=1234%10=4  print(4)  x=x//10=123
    print(b,end='')  #b=123%10=3 print(43)  x=x//10=12
    x=x//10

4321

In [63]:
x='ravi'
a=0
while x[a:]:  #x[0]
    a=a+1
    print(a)

1
2
3
4

In [48]:
x='ravi           '
a=0
for i in x:
    a=a+1
print(a)

15

In [62]:
x='ravi'
x[0]

'r'

In [66]:
n=1       
while n<=5:       #n=1   n kb tk chlna hh jb tak ki 5 ke equal na hojaye
    print("*"*n)  #  "*"*1   print *   "*"*2
    n=n+1  #n=1+1=2

*
**
***
****
*****

In [71]:
"*"*2

'**'